samples/SOAP XML/Iress/TimeSeriesGet2_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <TimeSeriesGet2 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <SessionKey>1861F237-16E9-41BB-A77D-DED307CC6506-097B3789-00C8-000A-0001-0089@IDS-TEST</SessionKey>
          <RequestID>DCB476EE-5BD4-42AB-A416-F7C2D5301FCC</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <SecurityCode>BHP</SecurityCode>
          <Exchange>ASX</Exchange>
          <DataSource xsi:nil="true" />
          <Frequency>Daily</Frequency>
          <TimeSeriesFromDate>2020-10-14</TimeSeriesFromDate>
          <TimeSeriesToDate>2020-10-15</TimeSeriesToDate>
          <SecurityText xsi:nil="true" />
        </Parameters>
      </Input>
    </TimeSeriesGet2>
  </soap:Body>
</soap:Envelope>